cask_args appdir: '/Applications'

# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
## Shell
brew 'bash'
brew 'zsh'
brew 'zsh-completions'
brew 'fasd'
brew 'fzf' # fast search
brew 'bat' # better cat
brew 'fd' # fast find

## Development
brew 'neovim'
brew 'tmux'
brew 'git'
brew 'git-lfs'
brew 'git-flow-avh'
brew 'tig'
brew 'jq'

## Languages
brew 'nodejs'
brew 'ruby'
brew 'octave'
brew 'lua'
brew 'python'
brew 'python@3.8'

## Database & serializers
brew 'hdf5'
brew 'msgpack'
brew 'sqlite'

## Multimedia
brew 'ffmpeg'
brew 'imagemagick'
brew 'pdf2svg'
brew 'svg2png'
brew 'asciinema' # record terminal

## GNU utils & others
brew 'coreutils'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gawk'
brew 'grep'
brew 'gnuplot'
brew 'tree'
brew 'texinfo'
brew 'telnet'
brew 'cmake'
brew 'wget'
brew 'htop'
brew 'md5sha1sum'
brew 'watch'
brew 'mas' # Mac App Store manager
brew 'zlib' # Needed for Memcached

# Apps for development
cask 'docker'
cask 'sequel-pro'
cask 'robo-3t'
cask 'java'
cask 'sublime-text'
cask 'postman'
cask 'visual-studio-code'

# Apps for research
cask 'basictex'
cask 'latexit'
cask 'mendeley'
cask 'notion'
cask 'grammarly'

# Apps
cask 'firefox'
cask 'google-chrome'
cask 'vlc'
cask 'dropbox'
cask 'skype'
cask 'zoomus'
cask 'slack'
cask 'the-unarchiver'
cask 'scroll-reverser'
cask 'rectangle' # alternative of spectacle

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'KakaoTalk', id: 869223134
mas 'line', id: 539883307
mas 'Todoist', id: 585829637
mas 'popupdic', id: 765419220
